install package

- `$ pip3 install mysqlclient`

In [3]:
import MySQLdb, pickle
import pandas as pd

In [16]:
# pw = pickle.load(open('pw.p','rb'))
pw = '123456Cc'

##### Connect

In [17]:
db = MySQLdb.connect(
    "127.0.0.1",
    "root",
    pw,
    "city_info",
    charset='utf8',
)

##### Select

In [18]:
SQL_QUERY = """
    SELECT *
    FROM popular;
"""

In [19]:
curs = db.cursor()
count = curs.execute(SQL_QUERY)
rows = curs.fetchall()
for row in rows:
    print(row)
# db.close()

(1, 'seoul', 30)
(2, 'busan', 3448737)
(3, 'incheon', 2890451)
(3, 'seoul', 11112223)
(6, 'gwanggju', 1502881)

##### insert, update, delete

In [20]:
SQL_QUERY_2 = """
    INSERT INTO popular(rank, city_name, popular)
    VALUES(6, "gwanggju", 1502881)
"""

In [21]:
curs = db.cursor()
count = curs.execute(SQL_QUERY_2)
db.commit()
# db.close()

##### database -> dataframe

In [22]:
city_df = pd.read_sql(SQL_QUERY, db)
city_df

   rank city_name   popular
0     1     seoul        30
1     2     busan   3448737
2     3   incheon   2890451
3     3     seoul  11112223
4     6  gwanggju   1502881
5     6  gwanggju   1502881

##### dataframe -> database

install package
- `$ pip3 install sqlalchemy`

In [23]:
import seaborn as sns
from sqlalchemy import create_engine

In [24]:
tips = sns.load_dataset("tips")
tips.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [25]:
engine = create_engine("mysql+mysqldb://root:" + pw + "@localhost/city_info")

tips.to_sql(name="tips", con=engine, if_exists='replace')

In [27]:
# engine = create_engine("mysql+mysqldb://root:" + pw + "@13.125.105.201/test")

# tips.to_sql(name="tips", con=engine, if_exists='replace')